# 8.2 ÏùºÎåÄÏùº Î≥ëÌï©
* ÏàòÌèâÍ≤∞Ìï© : Îç∞Ïù¥ÌÑ∞ ÌÖåÏù¥Î∏îÏùò Ïó¥ÏùÑ Îã§Î•∏ ÌÖåÏù¥Î∏îÏùò Ïó¥Í≥º Î≥ëÌï©ÌïòÎäî Í≤É
    - SQL join Ïó∞ÏÇ∞Ïóê Ìï¥Îãπ
    - 1. ÏùºÎåÄÏùº Î≥ëÌï© : ÏñëÏ™Ω ÌååÏùº Î™®ÎëêÏóêÏÑú Î≥ëÌï© Í∏∞Ï§Ä Ïó¥Ïóê Ï§ëÎ≥µÍ∞íÏù¥ ÏóÜÏùå
    - 2. ÏùºÎåÄÎã§ Î≥ëÌï© : Ïò§Î•∏Ï™Ω Îç∞Ïù¥ÌÑ∞ ÌÖåÏù¥Î∏îÏùò Î≥ëÌï© Í∏∞Ï§Ä Ïó¥Ïóê Ï§ëÎ≥µÏù¥ ÏûàÏùå
    - 3. Îã§ÎåÄÎã§ Î≥ëÌï© : ÏôºÏ™Ω, Ïò§Î•∏Ï™Ω Îç∞Ïù¥ÌÑ∞ ÌÖåÏù¥Î∏î Î™®ÎëêÏóêÏÑú Î≥ëÌï© Í∏∞Ï§Ä Ïó¥Ïóê Ï§ëÎ≥µ ÏûàÏùå
* Ïö©Ïñ¥Îäî 'Î≥ëÌï© Í∏∞Ï§Ä Ïó¥(Î≥ëÌï© Í∏∞Ï§Ä Í∞í, merge-by value)'ÏúºÎ°ú ÌÜµÏùºÌïòÏó¨ ÏÇ¨Ïö©
    - Í¥ÄÍ≥ÑÌòï Îç∞Ïù¥ÌÑ∞Î≤†Ïù¥Ïä§(RDB)Ïùò Í∏∞Î≥∏ ÌÇ§, Ïô∏Îûò ÌÇ§ Í∞úÎÖê Î∞∞Ï†ú
        - Í¥ÄÍ≥ÑÌòï ÏãúÏä§ÌÖúÏóêÏÑú Îç∞Ïù¥ÌÑ∞ Ï∂îÏ∂ú Ïãú ÏúÑÏùò Í∞úÎÖêÏùÑ ÌååÏïÖÌïòÎ©¥ ÎèÑÏõÄÎêòÍ≥†, ÌåêÎã§Ïä§ Ïù∏Îç±Ïä§Î•º ÏÑ§Ï†ïÌï† ÎïåÎèÑ Í≥†Î†§Ìï¥Ïïº ÌïòÎäî Î∂ÄÎ∂ÑÏûÑ
        - Í∑∏Îü¨ÎÇò Îç∞Ïù¥ÌÑ∞ Ï†ÑÏ≤òÎ¶¨ Í≥ºÏ†ï Ï§ë Î≥ëÌï©ÏùÑ ÌïòÎã§Î≥¥Î©¥ Ïù¥Îü¨Ìïú ÌÇ§Ïùò Î≤îÏúÑÎ•º ÎÑòÏñ¥ÏÑ§ÎïåÍ∞Ä ÎßéÏùå
        
* Ïú†Ïö©Ìïú ÏΩîÎìúüìå
    - **join** 
        - `{left dataframe}.join({right dataframe})` : ÏôºÏ™Ω/Ïò§Î•∏Ï™Ω Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑ ÏñëÏ™Ω Î™®ÎëêÏùò indexÍ∞Ä Î≥ëÌï© Í∏∞Ï§ÄÏúºÎ°ú ÏÇ¨Ïö©Îê† Ïàò ÏûàÎäî ÏÉÅÌÉúÏóêÏÑú Í∞ÄÏû• Ìö®Ïú®Ï†ÅÏù∏ ÏΩîÎìú
        - `{left dataframe}.join({right dataframe}.set_index(['Î≥ëÌï© Í∏∞Ï§Ä Ïó¥']))` : ÏôºÏ™Ω Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑÏùò indexÎ•º Î≥ëÌï© Í∏∞Ï§ÄÏúºÎ°ú ÏÇ¨Ïö© Ïãú 
        - `{left dataframe}.join({right dataframe}, on=['Î≥ëÌï© Í∏∞Ï§Ä Ïó¥']))` : ÏôºÏ™Ω/Ïò§Î•∏Ï™Ω Î™®Îëê indexÍ∞Ä Í∏∞Ï§ÄÏúºÎ°ú ÏÇ¨Ïö©Îê† Ïàò ÏóÜÏùÑ Îïå
    - **merge**
        - `pd.merge({left dataframe}, {right dataframe}, on=['Î≥ëÌï© Í∏∞Ï§Ä Ïó¥'], how='left')` : Î≥ëÌï© Í∏∞Ï§Ä Ïó¥, Î≥ëÌï© Î∞©ÏãùÏùÑ ÏßÅÏ†ë ÏÑ§Ï†ïÌïòÎäîÍ≤å Îπ†Î•º Îïå
    - join Ìï®ÏàòÎäî merge() Ìï®ÏàòÎ•º Í∏∞Î∞òÏúºÎ°ú ÎßåÎì§Ïñ¥Ï°åÏúºÎ©∞ ÏûëÎèôÎ∞©ÏãùÏù¥ ÎπÑÏä∑ÌïòÏßÄÎßå Ìñâ Ïù∏Îç±Ïä§Î•º Í∏∞Ï§ÄÏúºÎ°ú Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑÏùÑ Î≥ëÌï©ÌïúÎã§Îäî Ï†êÏóêÏÑú Ï∞®Ïù¥Í∞Ä ÏûàÎã§.(Ï∂úÏ≤ò : https://kimdingko-world.tistory.com/207)  
      Ï¶â, joinÏùÄ on Îß§Í∞úÎ≥ÄÏàò ÏÇ¨Ïö©ÌïòÏßÄ ÏïäÍ≥†ÎèÑ Î≥ëÌï©Ïù¥ Í∞ÄÎä•Ìï®

## Ï§ÄÎπÑ
* NLS Îç∞Ïù¥ÌÑ∞ÏÖã 2Í∞ú ÏÇ¨Ïö©
    - Ìïú Í∞úÏùò Ìñâ(row) = Ìïú ÏÇ¨ÎûåÏùò Îç∞Ïù¥ÌÑ∞
    - 1st file : Ï∑®ÏóÖ, ÌïôÎ†•, ÏÜåÎìù
    - 2nd file : ÏùëÎãµÏûêÏùò Î∂ÄÎ™®Ïùò ÏÜåÎìù, ÌïôÎ†•

## 8.2.1 left join

### 1. Îç∞Ïù¥ÌÑ∞ Î°úÎìú

In [118]:
import pandas as pd
import os
os.listdir('data')

['cmacitations.csv',
 'cmacitations.pkl',
 'cmacreators.csv',
 'cmacreators.pkl',
 'ghcn',
 'ltcountries.csv',
 'ltcountries.pkl',
 'ltcountry',
 'ltlocations.csv',
 'ltlocations.pkl',
 'nls97add.csv',
 'nls97add.pkl',
 'nls97colenr.csv',
 'nls97colenr.pkl',
 'nls97f.csv',
 'nls97f.pkl',
 'nls97weeksworked.csv',
 'nls97weeksworked.pkl']

In [119]:
# 1st file
nls97 = pd.read_csv('data/nls97f.csv')
nls97.set_index('personid', inplace=True)
# 2nd file
nls97add = pd.read_csv('data/nls97add.csv')

In [120]:
nls97.head()

,gender,birthmonth,birthyear,highestgradecompleted,maritalstatus,childathome,childnotathome,wageincome,weeklyhrscomputer,weeklyhrstv,...,colenroct13,colenrfeb14,colenroct14,colenrfeb15,colenroct15,colenrfeb16,colenroct16,colenrfeb17,colenroct17,originalid
personid,,,,,,,,,,,,,,,,,,,,,
100061,Female,5,1980,13.0,Married,4.0,0.0,12500.0,10 hours or more a week,11 to 20 hours a week,...,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,8245
100139,Male,9,1983,12.0,Married,2.0,0.0,120000.0,1 to 3 hours a week,3 to 10 hours a week,...,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,3962
100284,Male,11,1984,7.0,Never-married,1.0,0.0,58000.0,None,11 to 20 hours a week,...,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,3571
100292,Male,4,1982,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,NaN,NaN,NaN,NaN,2979
100583,Male,1,1980,13.0,Married,4.0,0.0,30000.0,Less than 1 hour a week,3 to 10 hours a week,...,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,8511

In [121]:
nls97.columns

Index(['gender', 'birthmonth', 'birthyear', 'highestgradecompleted',
       'maritalstatus', 'childathome', 'childnotathome', 'wageincome',
       'weeklyhrscomputer', 'weeklyhrstv', 'nightlyhrssleep', 'satverbal',
       'satmath', 'gpaoverall', 'gpaenglish', 'gpamath', 'gpascience',
       'highestdegree', 'govprovidejobs', 'govpricecontrols', 'govhealthcare',
       'govelderliving', 'govindhelp', 'govunemp', 'govincomediff',
       'govcollegefinance', 'govdecenthousing', 'govprotectenvironment',
       'weeksworked00', 'weeksworked01', 'weeksworked02', 'weeksworked03',
       'weeksworked04', 'weeksworked05', 'weeksworked06', 'weeksworked07',
       'weeksworked08', 'weeksworked09', 'weeksworked10', 'weeksworked11',
       'weeksworked12', 'weeksworked13', 'weeksworked14', 'weeksworked15',
       'weeksworked16', 'weeksworked17', 'colenrfeb97', 'colenroct97',
       'colenrfeb98', 'colenroct98', 'colenrfeb99', 'colenroct99',
       'colenrfeb00', 'colenroct00', 'colenrfeb01', 'colenroct01',
       'colenrfeb02', 'colenroct02', 'colenrfeb03', 'colenroct03',
       'colenrfeb04', 'colenroct04', 'colenrfeb05', 'colenroct05',
       'colenrfeb06', 'colenroct06', 'colenrfeb07', 'colenroct07',
       'colenrfeb08', 'colenroct08', 'colenrfeb09', 'colenroct09',
       'colenrfeb10', 'colenroct10', 'colenrfeb11', 'colenroct11',
       'colenrfeb12', 'colenroct12', 'colenrfeb13', 'colenroct13',
       'colenrfeb14', 'colenroct14', 'colenrfeb15', 'colenroct15',
       'colenrfeb16', 'colenroct16', 'colenrfeb17', 'colenroct17',
       'originalid'],
      dtype='object')

In [122]:
nls97.shape

(8984, 89)

In [123]:
nls97add.head()

   originalid  motherage  parentincome  fatherhighgrade  motherhighgrade
0           1         26            -3               16                8
1           2         19            -4               17               15
2           3         26         63000               -3               12
3           4         33         11700               12               12
4           5         34            -3               12               12

In [124]:
nls97add.shape

(8984, 5)

### 2. Ïú†ÏùºÍ∞í Í∞úÏàò - Ìñâ Ïàò Í∞ôÏùÄÏßÄ ÌôïÏù∏

In [125]:
nls97.originalid.nunique()==nls97.shape[0]

True

In [126]:
nls97add.originalid.nunique()==nls97add.shape[0]

True

### 3. Î∂àÏùºÏπòÌïòÎäî ID ÏÉùÏÑ±
- Ïã§Ïäµ Î™©Ï†ÅÏóê Îî∞Îùº Í≥†ÏùòÎ°ú ÌõºÏÜêÌï®
- originalidÎäî nls97 ÌååÏùº ÎßàÏßÄÎßâÏó¥, nls97add ÌååÏùº Ï≤´ Î≤àÏß∏ Ïó¥ÏûÑ

In [127]:
nls97.sort_values('originalid')

,gender,birthmonth,birthyear,highestgradecompleted,maritalstatus,childathome,childnotathome,wageincome,weeklyhrscomputer,weeklyhrstv,...,colenroct13,colenrfeb14,colenroct14,colenrfeb15,colenroct15,colenrfeb16,colenroct16,colenrfeb17,colenroct17,originalid
personid,,,,,,,,,,,,,,,,,,,,,
135335,Female,9,1981,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,NaN,NaN,NaN,NaN,1
999406,Male,7,1982,14.0,Never-married,NaN,NaN,116000.0,4 to 6 hours a week,3 to 10 hours a week,...,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,2
151672,Female,9,1983,16.0,Married,2.0,0.0,NaN,10 hours or more a week,3 to 10 hours a week,...,3. 4-year college,3. 4-year college,3. 4-year college,3. 4-year college,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,3
750699,Female,2,1981,13.0,Never-married,1.0,1.0,45000.0,1 to 3 hours a week,3 to 10 hours a week,...,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,4
781297,Male,10,1982,12.0,Married,2.0,0.0,125000.0,Less than 1 hour a week,3 to 10 hours a week,...,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,5
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
505861,Female,3,1980,10.0,Married,0.0,3.0,17500.0,4 to 6 hours a week,3 to 10 hours a week,...,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,9018
368078,Male,9,1984,14.0,Never-married,0.0,4.0,35000.0,Less than 1 hour a week,3 to 10 hours a week,...,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,9019
215605,Male,7,1980,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,3. 4-year college,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,NaN,NaN,NaN,NaN,9020
643085,Male,7,1980,17.0,Never-married,1.0,0.0,35000.0,10 hours or more a week,3 to 10 hours a week,...,3. 4-year college,3. 4-year college,3. 4-year college,3. 4-year college,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,9021
713757,Female,1,1982,20.0,Divorced,2.0,0.0,50000.0,10 hours or more a week,Less than 2 hours per week,...,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,9022

In [128]:
nls97 = nls97.sort_values('originalid')
nls97add = nls97add.sort_values('originalid')
nls97.iloc[0:2, -1] = nls97[0:2].originalid+10000
nls97.originalid.head(3)

personid
135335    10001
999406    10002
151672        3
Name: originalid, dtype: int64

In [129]:
nls97add.iloc[0:2, 0] = nls97add[0:2].originalid+20000
nls97add.originalid.head(3)

0    20001
1    20002
2        3
Name: originalid, dtype: int64

### 4. joinÏúºÎ°ú ÏôºÏ™Ω Ï°∞Ïù∏
* join()ÏùÄ Ìñâ Ïù∏Îç±Ïä§Î•º Í∏∞Ï§ÄÏúºÎ°ú Í≤∞Ìï©ÌïòÎäî Ìï®ÏàòÏù¥Îã§.
* ÏùºÏπòÌïòÎäî originalidÍ∞Ä ÏóÜÎäî ÌñâÎì§ÏùÄ Ïò§Î•∏Ï™Ω Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑ Ïó¥Ïùò Í∞íÎì§Ïù¥ Î™®Îëê ÎàÑÎùΩÎêúÎã§.
    * nls97 = ÏôºÏ™Ω Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑ
    * nls97add = Ïò§Î•∏Ï™Ω Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑ

In [130]:
nlsnew.index

Int64Index([   0,    1,    2,    3,    4,    5,    6,    7,    8,    9,
            ...
            8972, 8973, 8974, 8975, 8976, 8977, 8978, 8979, 8980, 8981],
           dtype='int64', length=8982)

In [131]:
# Ï±ÖÏóê Ï†úÏãúÎêú ÏΩîÎìú Ïã§Ìñâ Ïãú
nlsnew = nls97.join(nls97add.set_index(['originalid']))
nlsnew.loc[:,['originalid', 'gender', 'birthyear', 'motherage', 'parentincome']]
# nlsnew.loc[nlsnew.originalid>9999, ['originalid','gender','birthyear','motherage','parentincome']]

          originalid  gender  birthyear  motherage  parentincome
personid
135335         10001  Female       1981        NaN           NaN
999406         10002    Male       1982        NaN           NaN
151672             3  Female       1983        NaN           NaN
750699             4  Female       1981        NaN           NaN
781297             5    Male       1982        NaN           NaN
...              ...     ...        ...        ...           ...
505861          9018  Female       1980        NaN           NaN
368078          9019    Male       1984        NaN           NaN
215605          9020    Male       1980        NaN           NaN
643085          9021    Male       1980        NaN           NaN
713757          9022  Female       1982        NaN           NaN

[8984 rows x 5 columns]

In [132]:
# Ïò¨Î∞îÎ•¥Îã§Í≥† ÏÉùÍ∞ÅÎêòÎäî ÏΩîÎìú
nlsnew2 = nls97.set_index(['originalid']).join(nls97add.set_index(['originalid']))
nlsnew2.loc[:,['gender', 'birthyear', 'motherage', 'parentincome']]
# nlsnew2.loc[nlsnew2.index>9999,['gender', 'birthyear', 'motherage', 'parentincome']]

            gender  birthyear  motherage  parentincome
originalid
10001       Female       1981        NaN           NaN
10002         Male       1982        NaN           NaN
3           Female       1983       26.0       63000.0
4           Female       1981       33.0       11700.0
5             Male       1982       34.0          -3.0
...            ...        ...        ...           ...
9018        Female       1980       21.0          -3.0
9019          Male       1984       19.0          -3.0
9020          Male       1980       28.0       83750.0
9021          Male       1980       21.0       23000.0
9022        Female       1982       22.0       23000.0

[8984 rows x 4 columns]

### 5. mergeÎ°ú ÏôºÏ™Ω Ï°∞Ïù∏
- Ï≤´ Î≤àÏß∏ Îç∞Ïù¥ÌÑ∞(nls97) = ÏôºÏ™Ω Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑ
- Îëê Î≤àÏß∏ Îç∞Ïù¥ÌÑ∞(nls97add) = Ïò§Î•∏Ï™Ω Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑ
- on Îß§Í∞úÎ≥ÄÏàòÎ•º ÏÇ¨Ïö©Ìï¥ Î≥ëÌï© Í∏∞Ï§Ä Ïó¥ ÏßÄÏ†ï, how Îß§Í∞úÎ≥ÄÏàò Í∞íÏùÑ 'left'Î°ú ÏÑ§Ï†ïÌï®

In [133]:
nlsnew = pd.merge(nls97, nls97add, on=['originalid'], how='left')
nlsnew.loc[:, ['originalid','gender','birthyear','motherage','parentincome']]
# nlsnew.loc[nlsnew.originalid>9999, ['originalid','gender','birthyear','motherage','parentincome']]

      originalid  gender  birthyear  motherage  parentincome
0          10001  Female       1981        NaN           NaN
1          10002    Male       1982        NaN           NaN
2              3  Female       1983       26.0       63000.0
3              4  Female       1981       33.0       11700.0
4              5    Male       1982       34.0          -3.0
...          ...     ...        ...        ...           ...
8979        9018  Female       1980       21.0          -3.0
8980        9019    Male       1984       19.0          -3.0
8981        9020    Male       1980       28.0       83750.0
8982        9021    Male       1980       21.0       23000.0
8983        9022  Female       1982       22.0       23000.0

[8984 rows x 5 columns]

## 8.2.2 right/inner/right join

### 1. mergeÎ°ú Ïò§Î•∏Ï™Ω Ï°∞Ïù∏

In [134]:
nlsnew = pd.merge(nls97, nls97add, on=['originalid'], how='right')
# nlsnew.loc[:, ['originalid','gender','birthyear','motherage','parentincome']]
nlsnew.loc[nlsnew.originalid>9999, ['originalid','gender','birthyear','motherage','parentincome']]

   originalid gender  birthyear  motherage  parentincome
0       20001    NaN        NaN         26            -3
1       20002    NaN        NaN         19            -4

### 2. mergeÎ°ú ÎÇ¥Î∂Ä Ï°∞Ïù∏

In [135]:
nlsnew = pd.merge(nls97, nls97add, on=['originalid'], how='inner')
# nlsnew.loc[:, ['originalid','gender','birthyear','motherage','parentincome']]
nlsnew.loc[nlsnew.originalid>9999, ['originalid','gender','birthyear','motherage','parentincome']]

Empty DataFrame
Columns: [originalid, gender, birthyear, motherage, parentincome]
Index: []

### 3. mergeÎ°ú Ïô∏Î∂Ä Ï°∞Ïù∏

In [136]:
nlsnew = pd.merge(nls97, nls97add, on=['originalid'], how='outer')
# nlsnew.loc[:, ['originalid','gender','birthyear','motherage','parentincome']]
nlsnew.loc[nlsnew.originalid>9999, ['originalid','gender','birthyear','motherage','parentincome']]

      originalid  gender  birthyear  motherage  parentincome
0          10001  Female     1981.0        NaN           NaN
1          10002    Male     1982.0        NaN           NaN
8984       20001     NaN        NaN       26.0          -3.0
8985       20002     NaN        NaN       19.0          -4.0

## 8.2.3 ID Î∂àÏùºÏπò Í≤ÄÏÇ¨
- ÏôºÏ™Ω Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑ, Ïò§Î•∏Ï™Ω Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑ, Î≥ëÌï© Í∏∞Ï§Ä Ïó¥ÏùÑ Îß§Í∞úÎ≥ÄÏàòÎ°ú Î∞õÎäî Ìï®Ïàò ÎßåÎì§Í∏∞
    - Ïô∏Î∂Ä Ï°∞Ïù∏ÏùÑ ÏàòÌñâÌï¥ÏÑú, Î≥ëÌï© Í∏∞Ï§Ä Í∞íÏù¥ ÌïúÏ™Ω/ÏñëÏ™Ω Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑÏóê Î™®Îëê ÏûàÎäîÏßÄ Î≥º Í≤É

In [139]:
def checkmerge(dfleft, dfright, idvar):
    # ÏôºÏ™Ω Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑ ÌëúÏãùÏó¥
    dfleft['inleft'] = 'Y'
    # Ïò§Î•∏Ï™Ω Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑ ÌëúÏãùÏó¥
    dfright['inright'] = 'Y'
    # Í∞Å Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑÏùò idvarÍ≥º ÌëúÏãùÏó¥ÏùÑ, idvar Í∞í Í∏∞Ï§ÄÏúºÎ°ú Ïô∏Î∂Ä Ï°∞Ïù∏
    dfboth = pd.merge(dfleft[[idvar, 'inleft']], dfright[[idvar,'inright']], on=[idvar], how='outer')
    dfboth.fillna('N', inplace=True)
    print(pd.crosstab(dfboth.inleft, dfboth.inright))

In [140]:
checkmerge(nls97, nls97add, 'originalid')

inright  N     Y
inleft
N        0     2
Y        2  8982